[
  {
     "id": 1,
  "tipo": "esercizio",
  "categoria": "ECONOMIA AZIENDALE",
  "titolo": "RIMANENZE DI MAGAZZINO",
  "descrizione": "La Beta snc ha in magazzino all'inizio dell'esercizio 600 unità di merce X81YZ, valutate al prezzo unitario di 8 euro. Durante il primo trimestre si verificano le seguenti movimentazioni:\n15/01: scarico di 200 unità\n10/02: carico di 100 unità al prezzo di 9,00 euro;\n18/02: scarico di 60 unità;\n08/03: scarico di 40 unità;\n18/03: carico di 100 unità al prezzo di 8,80;\n28/03: scarico di 80 unità;\n\nCalcoliamo il valore degli scarichi di magazzino:\n1- con il metodo del costo medio ponderato continuo;\n2- con il metodo del costo medio ponderato per periodo;\n3- secondo il metodo LIFO;\n4- secondo il metodo FIFO; \n\n Il link sottostante rimanda a un video esplicativo dell'esercizio.",
  "testoBottone": "Vai all'esercizio",
  "data": "2025-11-20",
  "allegato": null,
  "riferimenti": ["https://www.youtube.com/watch?v=o1IC76dg6w4&t=367s"]
  },
  {
    "id": 2,
    "tipo": "guida",
    "categoria": "STRUMENTI PER DOCENTI",
    "titolo": "AI IN CLASSE",
    "descrizione": "Navigare le normative e padroneggiare gli strumenti: focus su NotebookLM",
    "testoBottone": "Leggi la guida",
    "data": "2025-11-20",
    "allegato": {
      "url": "allegati/AIINCLASSE.pdf"
    },"riferimenti": []
  },
  {
    "id": 3,
    "tipo": "guida",
    "categoria": "GPOI",
    "titolo": "GPOI: Riassunto quinto anno",
    "descrizione": "Modelli economici, Vincolo di bilancio, Domanda e offerta, investimento vs outsourcing, swiching costs, marketing, startup, redditività, liquidità e cicli aziendali, shareholder, stakeholder, sistema informativo aziendale: tempo, costi e risorse, WBS, CPM, Diagramma di GANTT",
    "testoBottone": "Leggi la guida",
    "data": "2025-11-21",
    "allegato": {
      "url": "allegati/GPOI.pdf"
    },"riferimenti": []
  },
  {
    "id": 4,
    "tipo": "guida",
    "categoria": "INFORMATICA TRIENNIO",
    "titolo": "LINGUAGGIO PHP: SINTASSI BASE",
    "descrizione": "Variabili, tipi di dati, operatori, strutture di controllo (if, switch, while, for), funzioni e array in PHP. Una panoramica essenziale per iniziare a programmare con PHP e sviluppare applicazioni web dinamiche.",
    "testoBottone": "Leggi la guida",
    "data": "2025-11-21",
    "allegato": {
      "url": "allegati/2_pillola_sintassibase.pdf"
    },
    "riferimenti": []
  },
  {
    "id": 5,
    "tipo": "guida",
    "categoria": "INFORMATICA BIENNIO",
    "titolo": "EXCEL: I PRINCIPI DI BASE",
    "descrizione": "Guida completa su Excel, comprendente:\n- Funzioni SOMMA, MEDIA, MAX, MIN\n- Riferimenti assoluti e relativi\n- Incidenza percentuale\n- Funzioni: CONTA.SE e SE\n\nIdeale per iniziare a gestire dati e calcoli automatici in modo efficace.\n In allegato una piccola guida realizzata con l'aiuto di Gemini",
    "testoBottone": "Leggi la guida",
    "data": "2025-11-21",
    "allegato": {
      "url": "allegati/EXCELIPRINCIPIDIBASE.pdf"
    },
    "riferimenti": []
  },
    {
    "id": 6,
    "tipo": "guida",
    "categoria": "INFORMATICA TRIENNIO",
    "titolo": "LINGUAGGIO PHP: SINTASSI BASE",
    "descrizione": "Costanti e variabili d'ambiente, visibilità delle variabili, passaggio parametri per default e per valore,",
    "testoBottone": "Leggi la guida",
    "data": "2025-11-21",
    "allegato": {
      "url": "allegati/2_pillola_variabili e funzioni.pdf"
    },
    "riferimenti": []
  },
  
    {
    "id": 7,
    "tipo": "guida",
    "categoria": "INFORMATICA TRIENNIO",
    "titolo": "LINGUAGGIO PHP: GESTIONE FILE",
    "descrizione": "Inclusione di codice da file esterno, lettura e scrittura di file, gestione degli errori durante le operazioni sui file, file CSV e file di testo.",
    "testoBottone": "Leggi la guida",
    "data": "2025-11-21",
    "allegato": {
      "url": "allegati/3_pillola_gestione_file.pdf"
    },
    "riferimenti": []
  },
   {
    "id": 8,
    "tipo": "guida",
    "categoria": "INFORMATICA TRIENNIO",
    "titolo": "LINGUAGGIO PHP: GESTIONE FORM",
    "descrizione": "Gestione dei form in PHP: invio dati tramite metodi GET e POST, esempio postback",
    "testoBottone": "Leggi la guida",
    "data": "2025-11-21",
    "allegato": {
      "url": "allegati/4_pillola_FORM.pdf"
    },
    "riferimenti": []
  },
  {
    "id": 9,
    "tipo": "guida",
    "categoria": "STRUMENTI PER DOCENTI",
    "titolo": "GUIDA OPERATIVA PER L'USO DI GOOGLE MODULES IN CLASSE",
    "descrizione": "Guida operativa per l'uso di Google Modules in classe: creazione, distribuzione e analisi dei moduli per migliorare l'apprendimento e la valutazione degli studenti.",
    "testoBottone": "Leggi la guida",
    "data": "2025-12-19",
    "allegato": {
      "url": "allegati/GuidaGoogleModuli.pdf"
    },
    "riferimenti": []
  },
  {
  "id": 10,
  "tipo": "esercizio",
  "categoria": "INFORMATICA BIENNIO",
  "titolo": "EXCEL: I PRINCIPI DI BASE - ANALISI DELLE VENDITE SETTIMANALI",
  "descrizione": "Analisi delle Vendite Settimanali in Excel\nObiettivo: Realizzare un foglio di calcolo per monitorare e analizzare le performance di vendita di quattro dipendenti, applicando formattazioni avanzate, formule statistiche, funzioni logiche e rappresentazioni grafiche.\n\n1. Configurazione e Formattazione Iniziale\n- Impostazione generale: Seleziona l'intero foglio di calcolo e imposta come carattere Verdana con dimensione 12.\n- Titolo del progetto: Inserisci un titolo nella cella A1. Seleziona l'intervallo di celle che copre la larghezza della tabella e utilizza la funzione \"Unisci e allinea al centro\". Applica lo stile grassetto.\n- Intestazioni di colonna: Per le celle contenenti i nomi dei giorni e dei venditori, attiva la funzione \"Testo a capo\". Allinea il testo centralmente, sia in orizzontale che in verticale, e applica il corsivo.\n- Struttura dati: Inserisci i nomi di quattro venditori (Rossi, Bianchi, Verdi, Corti) nelle righe e i giorni della settimana (Lunedì-Domenica) nelle colonne.\n\n2. Calcoli e Formule\n- Somme automatiche: Calcola il totale delle auto vendute settimanalmente per ogni venditore e il totale giornaliero per la squadra, utilizzando la funzione =SOMMA(). Utilizza il quadratino di trascinamento per copiare la formula nelle celle adiacenti.\n- Analisi statistica:\n  * Calcola la media delle vendite giornaliere per ogni venditore.\n  * Individua il valore minimo e massimo di auto vendute nell'intero intervallo settimanale.\n- Incidenza percentuale: Calcola la percentuale di vendite di ogni venditore rispetto al totale complessivo (parte piccola fratto parte grande). È obbligatorio utilizzare i riferimenti assoluti (simbolo $) per bloccare la cella del totale complessivo prima di trascinare la formula. Formatta il risultato come percentuale con un solo decimale.\n\n3. Logica e Automazione\n- Funzione SE: Inserisci una colonna Valutazione. Se il totale delle vendite settimanali è maggiore di 30, la cella deve restituire il testo \"Venditore Top\", altrimenti \"Da migliorare\".\n- Conteggio condizionale: Utilizza la funzione =CONTA.SE() per determinare in quanti giorni ogni venditore ha effettuato zero vendite.\n- Formattazione Condizionale: Applica le seguenti regole cromatiche alle vendite giornaliere:\n  * Rosso per valori minori di 5.\n  * Verde per valori maggiori di 9.\n  * Arancione per valori compresi tra 5 e 9.\n\n4. Visualizzazione e Bordi\n- Grafico: Inserisci un grafico a torta che rappresenti le vendite settimanali dei quattro venditori. Personalizza il titolo in \"Vendite settimanali\" e modifica la legenda affinché mostri i nomi dei venditori.\n- Bordi della tabella: Applica un bordo sottile azzurro a tutta la griglia (interno ed esterno). Per le sole intestazioni, applica un bordo blu scuro più spesso.",
  "testoBottone": "Vai all'esercizio",
  "data": "2026-01-12",
  "allegato": null,
  "riferimenti": ["https://www.youtube.com/watch?v=E31sjVKjlHg"]
}


  
]
